var data=[];

var dataStr='1! 1<br>\
<br>\
导演: 杰克·卡斯丹<br>\
编剧: 杰夫·皮克纳 / 斯科特·罗森伯格<br>\
主演: 道恩·强森 / 凯伦·吉兰 / 杰克·布莱克 / 凯文·哈特 / 尼克·乔纳斯 / 更多...<br>\
类型: 喜剧 / 动作 / 奇幻 / 冒险<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 2019-12-06(中国大陆) / 2019-12-13(美国)<br>\
<br>\
<br>\
2! 2<br>\
<br>\
导演: 克里斯托弗·麦奎里<br>\
编剧: 克里斯托弗·麦奎里 / 布鲁斯·盖勒<br>\
主演: 汤姆·克鲁斯 / 亨利·卡维尔 / 文·瑞姆斯 / 西蒙·佩吉 / 丽贝卡·弗格森 / 更多...<br>\
类型: 动作 / 惊悚 / 冒险<br>\
制片国家/地区: 美国 / 中国大陆 / 法国 / 挪威<br>\
语言: 英语 / 法语<br>\
上映日期: 2018-08-31(中国大陆) / 2018-07-27(美国)<br>\
<br>\
<br>\
3! 3<br>\
<br>\
导演: 温子仁<br>\
编剧: 克里斯·摩根 / 盖瑞·斯科特·汤普森<br>\
主演: 范·迪塞尔 / 保罗·沃克 / 杰森·斯坦森 / 米歇尔·罗德里格兹 / 乔丹娜·布鲁斯特 / 更多...<br>\
类型: 动作 / 犯罪<br>\
制片国家/地区: 美国 / 中国大陆 / 日本<br>\
语言: 英语<br>\
上映日期: 2015-04-12(中国大陆) / 2015-04-03(美国)<br>\
<br>\
<br>\
4! 4<br>\
<br>\
导演: 安东尼·罗素 / 乔·罗素<br>\
编剧: 克里斯托弗·马库斯 / 斯蒂芬·麦克菲利 / 杰克·科比 / 乔·西蒙<br>\
主演: 克里斯·埃文斯 / 小罗伯特·唐尼 / 斯嘉丽·约翰逊 / 塞巴斯蒂安·斯坦 / 安东尼·麦凯 / 更多...<br>\
类型: 动作 / 科幻 / 冒险<br>\
制片国家/地区: 美国<br>\
语言: 科萨语 / 英语 / 德语 / 俄语 / 罗马尼亚语<br>\
上映日期: 2016-05-06(中国大陆/美国) / 2016-04-12(加州首映)<br>\
<br>\
<br>\
5! 5<br>\
<br>\
导演: 乔·沃茨<br>\
编剧: 约翰·弗朗西斯·戴利 / 史蒂夫·迪特寇 / 乔纳森·M·戈尔茨坦 / 斯坦·李<br>\
主演: 汤姆·赫兰德 / 小罗伯特·唐尼 / 玛丽莎·托梅 / 迈克尔·基顿 / 雅各布·巴特朗 / 更多...<br>\
类型: 动作 / 科幻 / 冒险<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 2017-09-08(中国大陆) / 2017-06-28(洛杉矶首映) / 2017-07-07(美国)<br>\
<br>\
<br>\
6! 6<br>\
<br>\
导演: 乔斯·韦登<br>\
编剧: 乔斯·韦登 / 斯坦·李 / 杰克·科比<br>\
主演: 小罗伯特·唐尼 / 克里斯·海姆斯沃斯 / 马克·鲁弗洛 / 克里斯·埃文斯 / 斯嘉丽·约翰逊 / 更多...<br>\
类型: 动作 / 科幻 / 奇幻 / 冒险<br>\
制片国家/地区: 美国<br>\
语言: 英语 / 韩语<br>\
上映日期: 2015-05-12(中国大陆) / 2015-05-01(美国)<br>\
<br>\
<br>\
7! 7<br>\
<br>\
导演: 斯科特·德瑞克森<br>\
编剧: 史蒂夫·迪特寇 / 托马斯·迪恩·唐纳利 / 斯坦·李 / 乔·斯派茨 / 约书亚·奥本海默<br>\
主演: 本尼迪克特·康伯巴奇 / 蒂尔达·斯文顿 / 麦斯·米科尔森 / 切瓦特·埃加福 / 瑞秋·麦克亚当斯 / 更多...<br>\
类型: 动作 / 奇幻 / 冒险<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 2016-11-04(中国大陆/美国) / 2016-10-25(英国)<br>\
<br>\
<br>\
8! 8<br>\
<br>\
导演: 阿兰·泰勒<br>\
编剧: 克里斯托弗·约斯特 / 克里斯托弗·马库斯 / 斯蒂芬·麦克菲利 / 唐·佩恩 / 罗伯特·罗达特 / 斯坦·李 / 拉里·利伯 / 杰克·科比 / 沃尔特·西蒙森<br>\
主演: 克里斯·海姆斯沃斯 / 娜塔莉·波特曼 / 汤姆·希德勒斯顿 / 安东尼·霍普金斯 / 克里斯托弗·埃克莱斯顿 / 更多...<br>\
类型: 动作 / 奇幻 / 冒险<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 2013-11-08(中国大陆/美国)<br>\
<br>\
<br>\
9! 9<br>\
<br>\
导演: 佩顿·里德<br>\
编剧: 斯坦·李 / 杰克·科比 / 拉里·利伯 / 埃德加·赖特 / 乔·考尼什 / 亚当·麦凯 / 保罗·路德<br>\
主演: 保罗·路德 / 迈克尔·道格拉斯 / 伊万杰琳·莉莉 / 寇瑞·斯托尔 / 迈克尔·佩纳 / 更多...<br>\
类型: 动作 / 科幻 / 冒险<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 2015-10-16(中国大陆) / 2015-07-17(美国)<br>\
<br>\
<br>\
10! 10<br>\
<br>\
导演: 佩顿·里德<br>\
编剧: 克里斯·麦克纳 / 埃里克·萨默斯 / 保罗·路德 / 安德鲁·贝伦 / 加百利·法拉利<br>\
主演: 保罗·路德 / 伊万杰琳·莉莉 / 迈克尔·佩纳 / 汉娜·乔恩-卡门 / 沃尔顿·戈金斯 / 更多...<br>\
类型: 动作 / 科幻 / 冒险<br>\
制片国家/地区: 美国<br>\
语言: 英语<br>\
上映日期: 2018-08-24(中国大陆) / 2018-07-06(美国)<br>\
';


var d=dataStr.split('<br><br><br>');
for(var i=0;i<d.length;i++){
	var c=d[i].split('<br><br>');
	data.push({
	img:c[0].replace('! ',' ')+'.jpg',
	caption:c[0].split('! ')[1],
	desc:c[1] 
	});
	console.log(c[0].replace('! ',' ')+'.jpg');
}